<table align="left" width=100%>
    <tr>
        <td width="10%">
            <img src="in_class.png">
        </td>
        <td>
            <div align="center">
                <font color="#21618C" size=8px>
                    <b>Inclass - Lab<br> (Day 2)
                    </b>
                </font>
            </div>
        </td>
    </tr>
</table>

## Table of Content.
1. **[Data Structures with Examples](#Data_Structures)**
2. **[Create and Manipulate the Data Frames](#create_manipulate)**
3. **[Sorting](#sorting)**
4. **[Ranking](#ranking)**

### Let's begin with some hands-on practice exercises.

<a id='Data_Structures'></a>
## 1. Data Structures with Examples

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>1. Write a program to convert given array to an ordinary list with the same items
<b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the below array:**<br>
array1 = array('b', [21,23,63,74])

In [10]:
import array
array1 = array.array('b', [21,23,63,74])
import pandas as pd
pd.Series(array1)

0    21
1    23
2    63
3    74
dtype: int64

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>2. Extract second word from the given string
<b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the below string:**<br>
string = 'Be confident and be yourself'

In [17]:
string = 'Be confident and be yourself'
y= string.split()
string_list = pd.Series(y)
print(string_list)
string_list[1]

0           Be
1    confident
2          and
3           be
4     yourself
dtype: object

'confident'

<a id='create_manipulate'></a>
## 2. Create and Manipulate the Data Frames

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>3. Split a 'Name' column into two seperate columns <b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the below data frame:**<br>
df = pd.DataFrame({'Name': ['Emma Larter', 'Mia Junior', 'Sophia Depp', 'James Smith'],<br> 
                   'Salary':[3200, 4500, 3600, 5596]})

In [8]:
# write your code here
import pandas as pd 
df = pd.DataFrame({'Name': ['Emma Larter', 'Mia Junior', 'Sophia Depp', 'James Smith'],'Salary':[3200, 4500, 3600, 5596]})
df

          Name  Salary
0  Emma Larter    3200
1   Mia Junior    4500
2  Sophia Depp    3600
3  James Smith    5596

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>4. Select the rows from below data frame, whose marks is less than 60 <b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the below data frame:**<br>
df_student = pd.DataFrame({'Name': ['John', 'Robert', 'Jonny', 'Mia'],<br>
                           'Marks': [90, 50, 89, 55]<br>
})

In [12]:
# write your code here
df_student = pd.DataFrame({'Name': ['John', 'Robert', 'Jonny', 'Mia'],'Marks': [90, 50, 89, 55]})
final_df= df_student[df_student['Marks']<60]
final_df

     Name  Marks
1  Robert     50
3     Mia     55

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>5. Write a program to select the rows, where the sales are greater than 60000 for Mumbai location <b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the below dataframe:**<br>
df_store = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],<br>
                         'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'Hyderabad', 'Pune',<br>
                         'Mumbai', 'Pune'],<br>
                         'Sales': [40000, 45600, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000]<br>
})

In [13]:
import pandas as pd
df_store = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],
'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'Hyderabad', 'Pune',
'Mumbai', 'Pune'],
'Sales': [40000, 45600, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000]})
print(df_store)
Final_df=df_store[(df_store.Location == 'Mumbai') & (df_store.Sales>60000)]
print('sales are greater than 60000 for Mumbai location :-')
print(Final_df)

  Store   Location  Sales
0     A     Mumbai  40000
1     B       Pune  45600
2     A  Hyderabad  56000
3     C     Mumbai  90000
4     D       Pune  89000
5     A      Delhi  87000
6     D  Hyderabad  85000
7     A       Pune  78000
8     C     Mumbai  89000
9     B       Pune  70000
sales are greater than 60000 for Mumbai location :-
  Store Location  Sales
3     C   Mumbai  90000
8     C   Mumbai  89000

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>6. Write a program to display a summary of the basic information about a given data frame<b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the below dataframe:**<br>
df_store = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],<br>
                         'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'Hyderabad', 'Pune',<br>
                         'Mumbai', 'Pune'],<br>
                         'Sales': [40000, 45600, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000]<br>
})

In [14]:
df_store = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],
'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'Hyderabad', 'Pune',
'Mumbai', 'Pune'],
'Sales': [40000, 45600, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000]})
print(df_store.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Store     10 non-null     object
 1   Location  10 non-null     object
 2   Sales     10 non-null     int64
dtypes: int64(1), object(2)
memory usage: 368.0+ bytes
None

In [15]:
print(df_store.describe())

              Sales
count     10.000000
mean   72960.000000
std    19159.401522
min    40000.000000
25%    59500.000000
50%    81500.000000
75%    88500.000000
max    90000.000000

In [16]:
print(df_store.describe(include='all'))

       Store Location         Sales
count     10       10     10.000000
unique     4        4           NaN
top        A     Pune           NaN
freq       4        4           NaN
mean     NaN      NaN  72960.000000
std      NaN      NaN  19159.401522
min      NaN      NaN  40000.000000
25%      NaN      NaN  59500.000000
50%      NaN      NaN  81500.000000
75%      NaN      NaN  88500.000000
max      NaN      NaN  90000.000000

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>7. Write a program to replace the ‘Store' column, contains the values 'A', 'B', 'C', and 'D' with 'Store_A', Store_B', 'Store_C' and 'Store_D' respectively
<b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the below dataframe:**<br>
df_store = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],<br>
                         'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'Hyderabad', 'Pune',<br>
                         'Mumbai', 'Pune'],<br>
                         'Sales': [40000, 45600, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000]<br>
})

In [20]:
  df_store = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],
'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'Hyderabad', 'Pune',
'Mumbai', 'Pune'],
'Sales': [40000, 45600, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000]})
print(df_store)
df_store.Store=df_store.Store.map({'A':'Store_A', 'B':'Store_B', 'C':'Store_C','D':'Store_D'})
print('After replace :-')
print(df_store)

  Store   Location  Sales
0     A     Mumbai  40000
1     B       Pune  45600
2     A  Hyderabad  56000
3     C     Mumbai  90000
4     D       Pune  89000
5     A      Delhi  87000
6     D  Hyderabad  85000
7     A       Pune  78000
8     C     Mumbai  89000
9     B       Pune  70000
After replace :-
     Store   Location  Sales
0  Store_A     Mumbai  40000
1  Store_B       Pune  45600
2  Store_A  Hyderabad  56000
3  Store_C     Mumbai  90000
4  Store_D       Pune  89000
5  Store_A      Delhi  87000
6  Store_D  Hyderabad  85000
7  Store_A       Pune  78000
8  Store_C     Mumbai  89000
9  Store_B       Pune  70000

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>8. Create a dataframe in pandas using list and series
<b>
                </font>
            </div>
        </td>
    </tr>
</table>

In [10]:
x=pd.Series(['Maths','Physics','Fluid Mechanics','Som','Machine Design'])
y=[90,95,70,85,78]
print(type(x))
print(type(y))
Data={'Subject':x,'Marks':y}
pd.DataFrame(Data)

<class 'pandas.core.series.Series'>
<class 'list'>

           Subject  Marks
0            Maths     90
1          Physics     95
2  Fluid Mechanics     70
3              Som     85
4   Machine Design     78

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>9. Save a given dataframe to a csv file
<b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the below dataframe:**<br>
df_store = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],<br>
                         'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'Hyderabad', 'Pune',<br>
                         'Mumbai', 'Pune'],<br>
                         'Sales': [40000, 45600, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000]<br>
})

In [14]:
df_store = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],
'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'Hyderabad', 'Pune',
'Mumbai', 'Pune'],
'Sales': [40000, 45600, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000]})
print(df_store)
df_store.to_csv('Store.csv')
df_store2 = pd.read_csv('Store.csv')
print(df_store2)

  Store   Location  Sales
0     A     Mumbai  40000
1     B       Pune  45600
2     A  Hyderabad  56000
3     C     Mumbai  90000
4     D       Pune  89000
5     A      Delhi  87000
6     D  Hyderabad  85000
7     A       Pune  78000
8     C     Mumbai  89000
9     B       Pune  70000
   Unnamed: 0 Store   Location  Sales
0           0     A     Mumbai  40000
1           1     B       Pune  45600
2           2     A  Hyderabad  56000
3           3     C     Mumbai  90000
4           4     D       Pune  89000
5           5     A      Delhi  87000
6           6     D  Hyderabad  85000
7           7     A       Pune  78000
8           8     C     Mumbai  89000
9           9     B       Pune  70000

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>10. Find the maximum sales for each store
<b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the below dataframe:**<br>
df_store = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],<br>
                         'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'Hyderabad', 'Pune',<br>
                         'Mumbai', 'Pune'],<br>
                         'Sales': [40000, 45600, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000]<br>
})

In [1]:
import pandas as pd
df_store = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],
'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'Hyderabad', 'Pune',
'Mumbai', 'Pune'],
'Sales': [40000, 45600, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000]})
print(df_store)
grouped_df_store = df_store.groupby("Store")
maximums = grouped_df_store.max()
maximums = maximums.reset_index()
maximums.drop(columns='Location', inplace=True)
print(' maximum sales for each store :-')
print(maximums)

  Store   Location  Sales
0     A     Mumbai  40000
1     B       Pune  45600
2     A  Hyderabad  56000
3     C     Mumbai  90000
4     D       Pune  89000
5     A      Delhi  87000
6     D  Hyderabad  85000
7     A       Pune  78000
8     C     Mumbai  89000
9     B       Pune  70000
 maximum sales for each store :-
  Store  Sales
0     A  87000
1     B  70000
2     C  90000
3     D  89000

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>11. Write a program to select all columns, except 'Ranking_Rate' column in a data frame
<b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the below dataframe:**<br>
df_store = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],<br>
                         'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'Hyderabad', 'Pune',<br>
                         'Mumbai', 'Pune'],<br>
                         'Sales': [40000, 45600, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000]<br>
})

In [3]:
df_store = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],
'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'Hyderabad', 'Pune',
'Mumbai', 'Pune'],
'Sales': [40000, 45600, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000]})
print(df_store)
df_store['Ranking_Rate'] =df_store['Sales'].rank(ascending=0,method= 'min')
print('Added Ranking_Rate :-')
print(df_store)
df_store =df_store.loc[:,df_store.columns !='Ranking_Rate']
print('All columns  except Ranking_Rate column in a df_store :-')
print(df_store)

  Store   Location  Sales
0     A     Mumbai  40000
1     B       Pune  45600
2     A  Hyderabad  56000
3     C     Mumbai  90000
4     D       Pune  89000
5     A      Delhi  87000
6     D  Hyderabad  85000
7     A       Pune  78000
8     C     Mumbai  89000
9     B       Pune  70000
Added Ranking_Rate :-
  Store   Location  Sales  Ranking_Rate
0     A     Mumbai  40000          10.0
1     B       Pune  45600           9.0
2     A  Hyderabad  56000           8.0
3     C     Mumbai  90000           1.0
4     D       Pune  89000           2.0
5     A      Delhi  87000           4.0
6     D  Hyderabad  85000           5.0
7     A       Pune  78000           6.0
8     C     Mumbai  89000           2.0
9     B       Pune  70000           7.0
All columns  except Ranking_Rate column in a df_store :-
  Store   Location  Sales
0     A     Mumbai  40000
1     B       Pune  45600
2     A  Hyderabad  56000
3     C     Mumbai  90000
4     D       Pune  89000
5     A      Delhi  87000
6     D  Hyderabad  85000
7     A       Pune  78000
8     C     Mumbai  89000
9     B       Pune  70000

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>12. Write a program to insert a given column at a specific column index in a data frame
<b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the below data frame**<br>
data = {'Name': ['Emma Larter', 'Mia Junior', 'Sophia Depp', 'James Smith'], 'Age': [34, 59, 32, 40]}<br>
df = pd.DataFrame(data=data)<br><br>
**Add the new variable salary as third column**<br>
salary = [35000, 24000, 55000, 40000]

In [24]:
data = {'Name': ['Emma Larter', 'Mia Junior', 'Sophia Depp', 'James Smith'], 'Age': [34, 59, 32, 40]}
df = pd.DataFrame(data=data)
print(df)
df['salary']=[35000, 24000, 55000, 40000]
df

          Name  Age
0  Emma Larter   34
1   Mia Junior   59
2  Sophia Depp   32
3  James Smith   40

          Name  Age  salary
0  Emma Larter   34   35000
1   Mia Junior   59   24000
2  Sophia Depp   32   55000
3  James Smith   40   40000

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>13. Write a program to get the third row of a given data frame
<b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the below data frame**<br>
data = {'Name': ['Emma Larter', 'Mia Junior', 'Sophia Depp', 'James Smith'], 'Age': [34, 59, 32, 40]}<br>
df = pd.DataFrame(data=data)<br><br>

In [32]:
data = {'Name': ['Emma Larter', 'Mia Junior', 'Sophia Depp', 'James Smith'], 'Age': [34, 59, 32, 40]}
df = pd.DataFrame(data=data)
print(df)
print( 'Third row of a given data frame :-')
print(df.iloc[2])

          Name  Age
0  Emma Larter   34
1   Mia Junior   59
2  Sophia Depp   32
3  James Smith   40
Third row of a given data frame :-
Name    Sophia Depp
Age              32
Name: 2, dtype: object

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>14. Write a program to create a data frame from a numpy array
<b>
                </font>
            </div>
        </td>
    </tr>
</table>

In [52]:
import numpy as np
arr= np.array((['Som','Maths','Physics'],[90,78,82]))
print(type(arr))
print(arr.ndim)
df=pd.DataFrame(arr,index=['Subject','Marks'])
print(df.T)

<class 'numpy.ndarray'>
2
   Subject Marks
0      Som    90
1    Maths    78
2  Physics    82

In [57]:
#Or
Subject = np.array(['Thermodynamics','Fluid Mechanics','Mechanics','Machine Designe'])
Marks = np.array([78,67,86,75])
CGPA = np.array([2.5,3.5,3.8,4.0])
df= pd.DataFrame([Subject,Marks,CGPA], index=['Subject','Marks','CGPA'])
print(df.T)

           Subject Marks CGPA
0   Thermodynamics    78  2.5
1  Fluid Mechanics    67  3.5
2        Mechanics    86  3.8
3  Machine Designe    75  4.0

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>15. Write a programm to count total sales per store
<b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the below dataframe:**<br>
df_store = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],<br>
                         'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'Hyderabad', 'Pune',<br>
                         'Mumbai', 'Pune'],<br>
                         'Sales': [40000, 45600, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000]<br>
})

In [2]:
df_store = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],
'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'Hyderabad', 'Pune',
'Mumbai', 'Pune'],
'Sales': [40000, 45600, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000]})
print(df_store)
df_store['TotalSales'] = df_store['Sales'].groupby(df_store['Store']).transform('sum')
print('total sales per store :-')
print(df_store)

  Store   Location  Sales
0     A     Mumbai  40000
1     B       Pune  45600
2     A  Hyderabad  56000
3     C     Mumbai  90000
4     D       Pune  89000
5     A      Delhi  87000
6     D  Hyderabad  85000
7     A       Pune  78000
8     C     Mumbai  89000
9     B       Pune  70000
total sales per store :-
  Store   Location  Sales  TotalSales
0     A     Mumbai  40000      261000
1     B       Pune  45600      115600
2     A  Hyderabad  56000      261000
3     C     Mumbai  90000      179000
4     D       Pune  89000      174000
5     A      Delhi  87000      261000
6     D  Hyderabad  85000      174000
7     A       Pune  78000      261000
8     C     Mumbai  89000      179000
9     B       Pune  70000      115600

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>16. Write a program to count the most common words in a list
<b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the below list:**<br>
words_list = ['words', 'will', 'where', 'shall', 'we', 'will', 'shall', 'we', 'words', 'where', 'shall'<br>
        'will', 'there', 'wow', 'should', 'shall', 'we', 'where', 'should', 'where', 'will', 'there',<br>
        'now', 'where', 'we', 'will', 'where', 'should', 'will', 'where']

In [9]:
words_list = ['words', 'will', 'where', 'shall', 'we', 'will', 'shall', 'we', 'words', 'where', 'shall'
'will', 'there', 'wow', 'should', 'shall', 'we', 'where', 'should', 'where', 'will', 'there',
'now', 'where', 'we', 'will', 'where', 'should', 'will', 'where']
import numpy as np
import pandas as pd
pd.value_counts(np.array(words_list))

where        7
will         5
we           4
shall        3
should       3
words        2
there        2
shallwill    1
wow          1
now          1
dtype: int64

<a id='sorting'></a>
## 3. Sorting

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>17. Write a program to sort the data frame by 'Sales' in ascending order
<b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the below dataframe:**<br>
df_store = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],<br>
                         'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'Hyderabad', 'Pune',<br>
                         'Mumbai', 'Pune'],<br>
                         'Sales': [40000, 45600, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000]<br>
})

In [4]:
df_store = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],
'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'Hyderabad', 'Pune',
'Mumbai', 'Pune'],
'Sales': [40000, 45600, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000]})
print(df_store)
print('df_store  by Sales in ascending order :-')
df_store.sort_values('Sales')

  Store   Location  Sales
0     A     Mumbai  40000
1     B       Pune  45600
2     A  Hyderabad  56000
3     C     Mumbai  90000
4     D       Pune  89000
5     A      Delhi  87000
6     D  Hyderabad  85000
7     A       Pune  78000
8     C     Mumbai  89000
9     B       Pune  70000
df_store  by Sales in ascending order :-

  Store   Location  Sales
0     A     Mumbai  40000
1     B       Pune  45600
2     A  Hyderabad  56000
9     B       Pune  70000
7     A       Pune  78000
6     D  Hyderabad  85000
5     A      Delhi  87000
4     D       Pune  89000
8     C     Mumbai  89000
3     C     Mumbai  90000

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>18. Write a program to sort the data frame, first by 'Store' in ascending order, then by 'Sales' in descending order
<b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the below dataframe:**<br>
df_store = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],<br>
                         'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'Hyderabad', 'Pune',<br>
                         'Mumbai', 'Pune'],<br>
                         'Sales': [40000, 45600, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000]<br>
})

In [3]:
df_store = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],
'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'Hyderabad', 'Pune',
'Mumbai', 'Pune'],
'Sales': [40000, 45600, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000]})
print(df_store)
print('df_store by Store in ascending order :-')
print(df_store.sort_values('Store'))
print('df_store first by Store in ascending order, then by Sales in descending order :-')
print(df_store.sort_values('Store',ascending=False))

  Store   Location  Sales
0     A     Mumbai  40000
1     B       Pune  45600
2     A  Hyderabad  56000
3     C     Mumbai  90000
4     D       Pune  89000
5     A      Delhi  87000
6     D  Hyderabad  85000
7     A       Pune  78000
8     C     Mumbai  89000
9     B       Pune  70000
df_store by Store in ascending order :-
  Store   Location  Sales
0     A     Mumbai  40000
2     A  Hyderabad  56000
5     A      Delhi  87000
7     A       Pune  78000
1     B       Pune  45600
9     B       Pune  70000
3     C     Mumbai  90000
8     C     Mumbai  89000
4     D       Pune  89000
6     D  Hyderabad  85000
df_store first by Store in ascending order, then by Sales in descending order :-
  Store   Location  Sales
4     D       Pune  89000
6     D  Hyderabad  85000
3     C     Mumbai  90000
8     C     Mumbai  89000
1     B       Pune  45600
9     B       Pune  70000
0     A     Mumbai  40000
2     A  Hyderabad  56000
5     A      Delhi  87000
7     A       Pune  78000

<a id='ranking'></a>
## 4. Ranking

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>19. Create a column Rating_Rank, which contains the rank of each store based on sales of the product in ascending order
<b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the below dataframe:**<br>
df_store = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],<br>
                         'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'Hyderabad', 'Pune',<br>
                         'Mumbai', 'Pune'],<br>
                         'Sales': [40000, 45600, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000]<br>
})

In [7]:
df_store = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],
'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'Hyderabad', 'Pune',
'Mumbai', 'Pune'],
'Sales': [40000, 45600, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000]})
print(df_store)
print('column Rating_Rank, which contains the rank of each store based on sales of the product in ascending order :-')
df_store['Rating_Rank']=df_store.groupby('Sales')['Store'].rank(ascending=True,method='dense')
df_store

  Store   Location  Sales
0     A     Mumbai  40000
1     B       Pune  45600
2     A  Hyderabad  56000
3     C     Mumbai  90000
4     D       Pune  89000
5     A      Delhi  87000
6     D  Hyderabad  85000
7     A       Pune  78000
8     C     Mumbai  89000
9     B       Pune  70000
column Rating_Rank, which contains the rank of each store based on sales of the product in ascending order :-

  Store   Location  Sales  Rating_Rank
0     A     Mumbai  40000          1.0
1     B       Pune  45600          1.0
2     A  Hyderabad  56000          1.0
3     C     Mumbai  90000          1.0
4     D       Pune  89000          2.0
5     A      Delhi  87000          1.0
6     D  Hyderabad  85000          1.0
7     A       Pune  78000          1.0
8     C     Mumbai  89000          1.0
9     B       Pune  70000          1.0

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>20. Rank the data frame in descending order of sales by store
<b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the 'df_store' data frame**

In [9]:
df_store = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],
'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'Hyderabad', 'Pune',
'Mumbai', 'Pune'],
'Sales': [40000, 45600, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000]})
print(df_store)
print('Data frame in descending order of sales by store :-')
df_store['Rating_Rank']=df_store.groupby('Store')['Sales'].rank(ascending=0,method='dense')
df_store

  Store   Location  Sales
0     A     Mumbai  40000
1     B       Pune  45600
2     A  Hyderabad  56000
3     C     Mumbai  90000
4     D       Pune  89000
5     A      Delhi  87000
6     D  Hyderabad  85000
7     A       Pune  78000
8     C     Mumbai  89000
9     B       Pune  70000
Data frame in descending order of sales by store :-

  Store   Location  Sales  Rating_Rank
0     A     Mumbai  40000          4.0
1     B       Pune  45600          2.0
2     A  Hyderabad  56000          3.0
3     C     Mumbai  90000          1.0
4     D       Pune  89000          1.0
5     A      Delhi  87000          1.0
6     D  Hyderabad  85000          2.0
7     A       Pune  78000          2.0
8     C     Mumbai  89000          2.0
9     B       Pune  70000          1.0